Concat

In [2]:
import pandas as pd

weather =pd.DataFrame({
    "city" :['baglung' , 'kathmandu', 'gorkha'],
    "temprature" :[100 , 300 , 900],
    "humidity":[12 , 453, 453]
})

In [3]:
weather

        city  temprature  humidity
0    baglung         100        12
1  kathmandu         300       453
2     gorkha         900       453

In [4]:
weatherUs =pd.DataFrame({
    "city" :['ohio' , 'la', 'dc'],
    "temprature" :[10 , 30 , 90],
    "humidity":[124 , 4534, 4553]
})

In [5]:
weatherUs

   city  temprature  humidity
0  ohio          10       124
1    la          30      4534
2    dc          90      4553

In [8]:
df = pd.concat([weather , weatherUs],keys=["nepal","usa"])
df
#ignore_index = True

              city  temprature  humidity
nepal 0    baglung         100        12
      1  kathmandu         300       453
      2     gorkha         900       453
usa   0       ohio          10       124
      1         la          30      4534
      2         dc          90      4553

In [9]:
df.loc["usa"]

   city  temprature  humidity
0  ohio          10       124
1    la          30      4534
2    dc          90      4553

In [10]:
df.loc["nepal"]

        city  temprature  humidity
0    baglung         100        12
1  kathmandu         300       453
2     gorkha         900       453

In [15]:
temp = pd.DataFrame({
        "temprature" :[10 , 30 , 90],
        "windspeed": [100 , 400 , 500]
})

In [16]:
temp

   temprature  windspeed
0          10        100
1          30        400
2          90        500

In [21]:
df = pd.concat([temp , weather] , axis = 1)

In [22]:
df

   temprature  windspeed       city  temprature  humidity
0          10        100    baglung         100        12
1          30        400  kathmandu         300       453
2          90        500     gorkha         900       453